# # Напишите программу, которая считывает последовательность из 10 целых чисел и определяет является ли каждое из них четным или нет.
# # Формат входных данных
# # На вход программе подаются 10 целых чисел, каждое на отдельной строке.
# # Формат выходных данных
# # Программа должна вывести строку «YES», если все числа четные и «NO» в ином случае.
# a1 = int(input())
# a2 = int(input())
# a3 = int(input())
# a4 = int(input())
# a5 = int(input())
# a6 = int(input())
# a7 = int(input())
# a8 = int(input())
# a9 = int(input())
# a10 = int(input())
#
# if a1%2 == 0 and a2%2 == 0 and a3%2 == 0 and a4%2 == 0 and a5%2 == 0 and a6%2 == 0 and a7%2 == 0 and a8%2 == 0 and a9%2 == 0 and a10%2 == 0:
#     print('yes')
# else:
#     print('no')