# 1. Вывести на экран 10 раз своё имя
# 2. Вывести на экран числа от 1 до 100
# 3. Вывести на экран все четные числа от 1 до 100
# 4. Вывести на экран все числа от 1 до 100 кратные 4

#1
# for i in range (10):
#     print('aichurek'* i)

#or
for i in range(10):
    print('aichurek')

#2
# for i in range(1, 101):
#     print(i)

#3
# for i in range(2, 101, 2):
#     print(i)

#4
# for i in range(4, 101, 4):
#     print(i)