# 1. Вывести на экран все числа начиная с 0, пока сумма всех этих чисел не превысит 1000.
# 2.Пользователь вводит число. Программа завершится, когда пользователь
# введет значение больше 100. Ответ: Вы ввели число больше 100

#1
# i = 0
# while i < 1000:
#     i = i + 1
#     print(i)


#2

# number = int(input('enter a number - '))
# while number < 100:
#     number = int(input('enter a number - '))
# else:
#     print('Вы ввели число больше 100')


